Generating Random numbers

In [85]:
import pandas as pd
import numpy as np
df = pd.Series(np.random.rand(10))
df

0    0.213541
1    0.995527
2    0.583028
3    0.707003
4    0.502361
5    0.541022
6    0.062979
7    0.386301
8    0.835317
9    0.643081
dtype: float64

In [86]:
df=pd.read_excel(r"W:\JupyterWS\Files\file_example_10.xls")
df

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston      Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta       Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean     Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza    Weiland  Female  United States   40  21/05/2015  6548

Returns the datatype of each column

In [87]:
df.dtypes

0              int64
First Name    object
Last Name     object
Gender        object
Country       object
Age            int64
Date          object
Id             int64
dtype: object

Returns first 5 rows

In [88]:
df.head()

   0 First Name  Last Name  Gender        Country  Age        Date    Id
0  1      Dulce      Abril  Female  United States   32  15/10/2017  1562
1  2       Mara  Hashimoto  Female  Great Britain   25  16/08/2016  1582
2  3     Philip       Gent    Male         France   36  21/05/2015  2587
3  4   Kathleen     Hanner  Female  United States   25  15/10/2017  3549
4  5    Nereida    Magwood  Female  United States   58  16/08/2016  2468

Returns Last 5 rows

In [89]:
df.tail()

   0 First Name Last Name  Gender        Country  Age        Date    Id
4  5    Nereida   Magwood  Female  United States   58  16/08/2016  2468
5  6     Gaston     Brumm    Male  United States   24  21/05/2015  2554
6  7       Etta      Hurn  Female  Great Britain   56  15/10/2017  3598
7  8    Earlean    Melgar  Female  United States   27  16/08/2016  2456
8  9   Vincenza   Weiland  Female  United States   40  21/05/2015  6548

Describing a DataFrame. By default only numeric fields are returned.

In [90]:
df.describe()

              0        Age           Id
count  9.000000   9.000000     9.000000
mean   5.000000  35.888889  2989.333333
std    2.738613  13.147666  1511.344517
min    1.000000  24.000000  1562.000000
25%    3.000000  25.000000  2456.000000
50%    5.000000  32.000000  2554.000000
75%    7.000000  40.000000  3549.000000
max    9.000000  58.000000  6548.000000

Describing a DataFrame. For categorical field.

In [91]:
df1 = pd.DataFrame(df, columns= ['First Name', 'Last Name','Gender'])
df1.describe()

       First Name  Last Name  Gender
count           9          9       9
unique          9          9       2
top      Vincenza  Hashimoto  Female
freq            1          1       7

Describing all columns of a DataFrame regardless of data type.

In [92]:
df.describe(include="all")

,0,First Name,Last Name,Gender,Country,Age,Date,Id
count,9.000000,9,9,9,9,9.000000,9,9.000000
unique,NaN,9,9,2,3,NaN,3,NaN
top,NaN,Vincenza,Hashimoto,Female,United States,NaN,21/05/2015,NaN
freq,NaN,1,1,7,6,NaN,3,NaN
mean,5.000000,NaN,NaN,NaN,NaN,35.888889,NaN,2989.333333
std,2.738613,NaN,NaN,NaN,NaN,13.147666,NaN,1511.344517
min,1.000000,NaN,NaN,NaN,NaN,24.000000,NaN,1562.000000
25%,3.000000,NaN,NaN,NaN,NaN,25.000000,NaN,2456.000000
50%,5.000000,NaN,NaN,NaN,NaN,32.000000,NaN,2554.000000
75%,7.000000,NaN,NaN,NaN,NaN,40.000000,NaN,3549.000000
max,9.000000,NaN,NaN,NaN,NaN,58.000000,NaN,6548.000000

Returns the shape of the DataFrame i.e Rows X Columns

In [93]:
df.shape

(9, 8)

axes- Returns a list of the row axis labels

In [94]:
df.axes

[RangeIndex(start=0, stop=9, step=1),
 Index([0, 'First Name', 'Last Name', 'Gender', 'Country', 'Age', 'Date', 'Id'], dtype='object')]

Checks If Data Frame has empty values or not

In [95]:
df.empty

False

Returns dimensions of the Data Frame

In [96]:
df.ndim

2

Returns numbers of cells in Data Frame

In [97]:
df.size

72

Returns every row as an element of array

In [98]:
df.values

array([[1, 'Dulce', 'Abril', 'Female', 'United States', 32, '15/10/2017',
        1562],
       [2, 'Mara', 'Hashimoto', 'Female', 'Great Britain', 25,
        '16/08/2016', 1582],
       [3, 'Philip', 'Gent', 'Male', 'France', 36, '21/05/2015', 2587],
       [4, 'Kathleen', 'Hanner', 'Female', 'United States', 25,
        '15/10/2017', 3549],
       [5, 'Nereida', 'Magwood', 'Female', 'United States', 58,
        '16/08/2016', 2468],
       [6, 'Gaston', 'Brumm', 'Male', 'United States', 24, '21/05/2015',
        2554],
       [7, 'Etta', 'Hurn', 'Female', 'Great Britain', 56, '15/10/2017',
        3598],
       [8, 'Earlean', 'Melgar', 'Female', 'United States', 27,
        '16/08/2016', 2456],
       [9, 'Vincenza', 'Weiland', 'Female', 'United States', 40,
        '21/05/2015', 6548]], dtype=object)

Returns transpose of the matrix

In [99]:
df.T

,0,1,2,3,4,5,6,7,8
0,1,2,3,4,5,6,7,8,9
First Name,Dulce,Mara,Philip,Kathleen,Nereida,Gaston,Etta,Earlean,Vincenza
Last Name,Abril,Hashimoto,Gent,Hanner,Magwood,Brumm,Hurn,Melgar,Weiland
Gender,Female,Female,Male,Female,Female,Male,Female,Female,Female
Country,United States,Great Britain,France,United States,United States,United States,Great Britain,United States,United States
Age,32,25,36,25,58,24,56,27,40
Date,15/10/2017,16/08/2016,21/05/2015,15/10/2017,16/08/2016,21/05/2015,15/10/2017,16/08/2016,21/05/2015
Id,1562,1582,2587,3549,2468,2554,3598,2456,6548